<?php
//星座运势
return [
 	//白羊
	'baiyang' => [
		'ys'=>['蛰伏隐忍,厚积薄','好事多磨,学有所用','小人暗藏,沟通不畅','紧张丛生,贵人有临','压力延续',
		'注意平衡','因果显现,查缺补漏','掌握先机,拿捏好分寸','直来直往,节奏混乱','积极向上','金钱需求量大',
		'多锻炼身体,异性缘好','缺乏信任,强化沟通力','防人之心不可无','夫妻和睦'],
		'yi' => ['合 帐','裁 衣','教 牛 马','馀 事 勿 取'],
		'ji' => ['诸 事 不 宜'],
        'xz' => '白羊座',
        'hong' =>['多休息','爱自由','热情','直率']
	],
	// 金牛
	'jinniu' => [
		'ys'=>['意气风发，直面挑战','一丝不苟,严谨认真','心灵交融，萌芽丛生','踏实赚钱,贵人丛生','收支平衡，健康好转',
		'波澜起伏,自欺欺人','丰富多彩,生活充实','之处频繁','幸运常伴,加薪机会','桃花朵朵.工作积极','牺牲自我',
		'精力旺盛,兢兢业业,努力拼搏,应付自如','勇气','毅力','全力以赴,迎接挑战','满足','花销较多','务实'],
		'yi' => ['裁 衣','作 灶','搬 家','入 宅','纳 畜'],
		'ji' => ['结 婚','安 葬'],
        'xz' => '金牛座',
        'hong'=>['沉默','安逸','踏实','耐性','偏见','浪漫','依赖心']
	],
	// 双子
	'shuangzi' => [
		'ys'=>['安静避世,情感挂心','顶住压力,迎难而上','不求浪漫','只求稳定','转折显现','保守为主','严格要求','承受压力，',
		'求学严谨','实践','紧张忙碌','思维短路','自我施压','不知所措','积极表现','钱财耗散','脚踏实地','操之过急','冒险',
		'理性','耐心','细致','沟通欠缺','寻寻觅觅','多多沟通'],
		'yi' => ['订 婚','祭 祀','祈 福','解 除','动 土','破 土','安 葬'],
		'ji' => ['结 婚','搬 家','入 宅'],
        'xz' => '双子座',
        'hong'=>['深情','开朗','好奇']
	],
	// 巨蟹座（6.22-7.22）
	'juxie' => [
		'ys'=>['风水轮转,苦尽甘来','理性分析,保持冷静','积极应对,远离逃避','贵人相助','保守为主,关注自我','活力展现',
		'放下过去,改变自我','贵人来临','理解','保持低调','挑战','机遇','冲动','不知所措,计划脱轨','理财',
		'如鱼得水','日久生情','水到渠成','努力','波澜起伏','耐心','精打细算'],
		'yi' => ['结 婚','出 行','纳 畜','祭 祀','入 殓','启 钻','安 葬'],
		'ji' => ['作 灶','动 土','破 土'],
        'xz' => '金牛座',
        'hong'=>['主观','温柔','反应佳','慎重' ,'友善','有爱心']
	],
	//狮子座（7.23-8.22）
	'shizi' => [
		'ys'=>['沉迷虚幻,难辨真心','心态漂浮,错失良机','迷糊混乱,选择舍弃','守为主','预防损失,控制自我','爱惜自己',
		'自信有加','自我膨胀,诸事顺心','收入稳定,缺乏锻炼','注重细节,工作忙碌','辨别桃花','舍弃','回归现实,接受挑战','多徘徊'],
		'yi' => ['祭 祀','沐 浴','破 屋','坏 垣','馀 事','勿 取'],
		'ji' => ['搬 家','入 宅','出 行','栽 种'],
        'xz' => '狮子座',
        'hong'=>['热情','善良','正义感']
	],
	// 处女座（8.23-9.22）
	'chunv' => [
		'ys'=>['自信满满,激情迸发','阴影去除,潜心积累','打破束缚,寻求自由','极端失衡,踏实为主','稳步向前','隐患丛生,遭遇挫折',
		'重塑自我','奔波','付出关怀,变化多端','贵人相助,琐碎事较多','无奈,多耐心','多宽容','多理解','争取机会,事业运较旺',
		'行事果断','切勿畏首畏尾','有条不紊,工作积极','人际关系融洽','保守理财,树大招风','优秀'],
		'yi' => ['作 灶','造 畜 稠'],
		'ji' => ['行 丧','安 葬'],
        'xz' => '处女座',
        'hong'=>['细心','温柔','开朗','完美','调皮','热情','害羞']
	],
	//天秤座（9.23-10.23）
	'tianping' => [
		'ys'=>['努力奋发,一展宏图','整装待发,充满希望','惊喜不断,困惑伴随','冲突减弱','贵人相助','劳逸结合,相辅相成','得失并存',
		'沉浸自我','择良木而栖','固执保守,独立','为爱义无反顾','多暧昧,多暗恋','协调人际关系','年中投资,研究学习','避免过度自我',
		'不易冲动','多波折','摇摆不定,内心矛盾','财务上升,有贵人相助'],
		'yi' => ['祭 祀','解 除','破 屋','坏 垣','馀 事 勿 取'],
		'ji' => ['破 土','动 土'],
        'xz' => '天秤座',
        'hong'=>['魅力','美丽','自恋','爱美','公正']
	],
	//天蝎座（10.24-11.22）
	'tianxie' => [
		'ys'=>['目标重现,迷茫退却','历经考验,脱颖而出','凤凰涅槃,浴火重生','建立信心,转变现状','缓慢回升,波折丛生','平稳前行',
		'讲究效率','感情用事,不理智','保持客观,收获丰腴','被认可','与人和平相处','保持理智,放远目光', '收支平衡,工作顺畅','贵人相助','桃花运'],
		'yi' => ['教 牛 马','馀 事 勿 取'],
		'ji' => ['入 宅','动 土','破 土','馀 事 勿 取'],
        'xz' => '天蝎座',
        'hong'=>['智慧','理智']
	],
	//射手座（11.23-12.21）
	'sheshou' => [
		'ys'=>['戒骄戒躁,平稳心态','虚心学习,累积经验','打破束缚,勇敢前行','动力十足,取悦自我','心生忧虑,调整修养','潜心深造',
		'收获满满','精力过剩','逐渐成长','莫急于求成','避免冲突,细心谋划','收入稳定','义无反顾','个人魅力强大','理性投资,坚定信念',
        '急功近利','累积经验','打破束缚,行动力满满','远途旅行'],
		'yi' => ['祭 祀','会 亲 友','出 行','订 盟','订 婚','沐 浴','装 修','动 土','祈 福','斋 醮','结 婚','拆 卸','安 床','入 殓',
		'移 柩','安 葬','谢 土','赴 任','裁 衣','竖 柱','上 梁','伐 木','捕 捉','栽 种','破 土','安 门'],
		'ji' => ['盖 屋','开 工','作 灶','入 宅'],
        'xz' => '射手座',
        'hong'=>['活泼','可爱','乐观']
	],
	//摩羯座（12.22-1.19）
	'moxie' => [
		'ys'=>['突破困境,柳暗花明','考验来临,转变方式','迷惑欺瞒','做出选择','贵人相助,盆钵满满','突发来临','重新构建',
		'放轻压力','顺势而为,保持稳重','社交热络','理性','有计划','加强表达能力','感情混乱,工作繁忙','缺乏锻炼',
		'想法多','执行力强,工作融洽','投资','先苦后甜,接受考验','调整目标','谎言','贵人相助'],
		'yi' => ['祭祀','求嗣','沐浴','酬神','订盟','订婚','裁衣','合帐','冠笄','安机械','安床','造仓','开池','经络',
		'纳财','开 工','立 券','交 易','结 网','取 渔','纳 畜','捕 捉'],
		'ji' => ['安 葬','作 灶','伐 木','作 梁'],
        'xz' => '摩羯座',
        'hong'=>['优越','聪慧','实际','宽大','乐观']
	],
	//水瓶座（1.20-2.18）
	'shuiping' => [
		'ys'=>['承受压力,谨慎行事','稳健行事,收获丰厚','危机四伏','难以坚持','波折起伏,化险为夷','学习自控,劳逸结合','互惠互利',
		'把握投资,把握机会','多追求者','放松心情','调整态度,适当施压','贵人多','与人合作','感情起伏不定','敢冒险',
		'谨慎','容易走极端','多挑战','收支不平衡','理性分析,提升自我','旅行'],
		'yi' => ['祭 祀','开 光','塑 绘','订 盟','订 婚','合 帐','冠 笄','拆 卸','动 土','起 基','上 梁','入 宅','安 香','开 工',
		'立 券','纳 财','沐 浴','求 嗣','出 火','竖 柱','安 门'],
		'ji' => ['造 庙','结 婚','伐 木','安 葬'],
        'xz' => '水瓶座',
        'hong'=>['友爱','慈善','博爱','宽容','理想','冷静']
	],
	// 双鱼座（2.19-3.20）
	'shuangyu' => [
		'ys'=>['压力解除,创意缤纷','节制自身,落实行动','灵感限制','顿生迷茫','收获颇丰','去除焦虑','忙中有闲,健康为主','静心学习',
		'制定计划,未雨绸缪','生活安逸','事业运','财运,爱情运高升','多思考,多规划','注意收支平衡','学会调节情绪','保持乐观的态度',
		'积极生活,聚会增多','渴望共享快乐幸福','建议假期旅游','控制火爆脾气','切忌正面顶撞','切勿眼高手低','量力而行','自由','克服懒惰'],
		'yi' => ['订 婚','开 光','求 医','治 病','动 土','上 梁','搬 家','入 宅'],
		'ji' => ['结 婚','开 工','安 葬'],
        'xz' => '双鱼座',
        'hong'=>['自觉','唯美','善良','好脾气']
	],
    'shu' => [
        'ys' => ['事业运强、桃花旺','正财大运、灵感不断','想象力丰富、锐意进取','仕途进利、升迁高就',
            '吉星照、谨慎可凶化吉','运势不错、机会颇多','贵人相助、事业运佳','平淡生资的好年'],
        'yi' => ['创 新','创 作','考 学','考 证'],
        'ji' => ['安 葬','投 资','入 宅']
    ],
    'niu' => [
        'ys' => ['谨慎做事、保守稳定','贵人帮身、做事可欣','逆流而上、处事低调','可于远方得名得利','劳而有功的一年','退守为安、单身牛桃花运'],
        'yi' => ['宜 动','机 缘','外 游','考 学'],
        'ji' => ['争 强','上 梁','晚 睡']
    ],
    'hu' => [
        'ys' => ['三合贵人、偏财流年','桃花旺、运势发展平稳','应脚踏实地，稳中求胜','事业发展顺利','有贵人鼎力相助','财运平稳向上，盛运之中',
            '宜正财远偏财','保持谦逊、理智冷静'],
        'yi' => ['谨 慎','多 想','考 学','求 学','添 丁','进 取'],
        'ji' => ['投 资','流 财','动 土','探 病']
    ],
    'tu' => [
        'ys' => ['贵人帮扶、合太岁','桃花旺、运势稳定','吉星相助、脚踏实地专注','紫气东来、财源滚滚','正财偏财两旺把握机会'],
        'yi' => ['合 作','跳 槽','置 业','添 丁'],
        'ji' => ['投 机','财 露']
    ],
    'long' => [
        'ys' => ['正财运旺、谨慎保守','三思而行、逢凶化吉','厚积、以等待良机、谋定而后动','注意锻炼和饮食','投资需谨慎、宜节省开支'],
        'yi' => ['求 学','合 作','置 业'],
        'ji' => ['桃 花','投 资','动 土']
    ],
    'she' => [
        'ys' => ['一路顺畅、名利两旺','佳偶天成、左右逢源','升职加薪、贵人相助','桃花星、广结善缘年'],
        'yi' => ['跳 槽','相 亲','升 迁'],
        'ji' => ['远 行','动 土','慵 懒']
    ],
    'ma' => [
        'ys' => ['运势极好、升职加薪','桃花朵朵、左右逢源','“将星”临门、权名双收','斗志旺盛、逢凶化吉','脚踏实地，积极进取','正财平稳、偏财不平','宜动不宜静'],
        'yi' => ['留 学','移 民','相 亲','添 丁','婚 嫁'],
        'ji' => ['懒 惰','高 危','爬 窗']
    ],
    'yang' => [
        'ys' => ['破太岁、升官进财','前途光明、机遇和挑战并存','天德星临、贵人相助','保持心态豁达积极','熟悉领域创业易成功，利远方投资','投资获利、切忌贪心'],
        'yi' => ['销 售','出 差','旅 行'],
        'ji' => ['暴 食','投 资','激 动']
    ],
    'hou' => [
        'ys' => ['驿马星临、利于远行','贵人扶助、财运畅通','情绪易波动','文昌入命、读书易成','经商投资、务求谨慎'],
        'yi' => ['外 出','经 商','出 差','进 修','考 证','搬 迁','出 国'],
        'ji' => ['探 病','问 丧','投 机','取 巧']
    ],
    'ji' => [
        'ys' => ['事业平稳上升、害太岁','正财可期、偏财欠佳','不可贪不义之财','中规中矩、不宜做大的改变'],
        'yi' => ['转 行','跳 槽','添 丁','婚 嫁'],
        'ji' => ['投 资','饮 酒','吸 烟']
    ],
    'gou' => [
        'ys' => ['正财偏财皆平','一动不如一静','一喜挡三灾','岁驾星临、才华得展',' 利运输与创作行业','可穿配转运之物、利学习'],
        'yi' => ['外 出','郊 游','结 婚','置 业','添 丁'],
        'ji' => ['定 盟','跳 槽']
    ],
    'zhu' => [
        'ys' => ['忍耐年、贵人赏识','桃花之年、财运亨通','想象力丰富、事业运佳','三大吉星、运势佳','丰收的一年','太阳吉星、远行生财'],
        'yi' => ['婚 嫁','添 丁','购 房','升 职'],
        'ji' => ['动 土','饮 酒','慵 懒']
    ],
];
