<?php

return [
    //白羊
    'baiyang' => [
        'ys'=>['爱冒险、行动派','脑洞超大、爱憎分明','有领导天赋','单纯热情、独行侠','孩子气、喜欢控制一切'],

    ],
    // 金牛
    'jinniu' => [
        'ys'=>['慢热保守、理财高手','热心肠、沉稳大气','超强的执行力','逆天判断力','冲动的火药桶','现实主义者'],
    ],
    // 双子
    'shuangzi' => [
        'ys'=>['思维敏捷、幽默机智','多才多艺、擅长沟通','适应力强、充满生命力','八面玲珑、善于交际','善变的戏精'],
    ],
    // 巨蟹座（6.22-7.22）
    'juxie' => [
        'ys'=>['重情义、贴心暖宝宝','想象力丰富、善解人意','不屈不挠、领导力卓越','富有同情心、脑筋敏锐','有责任感、有艺术天赋','适应力强、领悟力超强'],
    ],
    //狮子座（7.23-8.22）
    'shizi' => [
        'ys'=>['性格开朗、思想开阔','热心慷慨、有创新能力','强迫症、懒癌患者','喜欢指挥别人','主观意识太强','领导力潜质','超自信、外貌协会'],
    ],
    // 处女座（8.23-9.22）
    'chunv' => [
        'ys'=>['温柔大方、内敛而保守','高智商人群、脚踏实地','精确的观察力','外貌协会、细节控','冷静理智、超强分析力','完美主义晚期','强迫症、野心家'],
    ],
    //天秤座（9.23-10.23）
    'tianping' => [
        'ys'=>['逻辑强，善分析','有正义感、适应力强','艺术才华爆表','天资聪敏，遇事冷静','高情商人群、极有人缘','犹豫不决、颜值控','好奇宝宝'],
    ],
    //天蝎座（10.24-11.22）
    'tianxie' => [
        'ys'=>['精力旺盛、占有欲极强','神秘敏锐、智慧理智','实力记仇、洞察力惊人','有个性但念旧','外貌协会、不服输精神'],
    ],
    //射手座（11.23-12.21）
    'sheshou' => [
        'ys'=>['勇敢果断、活泼可爱','乐观主义、热情善良','行动派、赋有才华','开心果、艺术范强大'],
    ],
    //摩羯座（12.22-1.19）
    'moxie' => [
        'ys'=>['事脚踏实地、很有耐心','野心家、善良又勤奋','富有正义感成熟稳重','天生冷静的判断力','潜力股、细节控'],
    ],
    //水瓶座（1.20-2.18）
    'shuiping' => [
        'ys'=>['爱自由、创新能力','天马行空的想象力','逆天判断力冒险家','梦想家、外星生物','戒急戒躁、神逻辑','不按套路走、脑洞大'],
    ],
    // 双鱼座（2.19-3.20）
    'shuangyu' => [
        'ys'=>['善良又细心','爱逃避困难、善解人意','直觉力强、意志薄弱','不现实、极富爱心','爱 “做 梦”','天生的艺术家很会浪漫','脑洞大爱幻想、玻璃心'],
    ],
    'shu' => [
        'ys' => ['事业运强、桃花旺','正财大运、灵感不断','想象力丰富、锐意进取','仕途进利、升迁高就',
            '吉星照、谨慎可凶化吉','运势不错、机会颇多','贵人相助、事业运佳','平淡生资的好年','得名大于得利','偏财难得、正财可谋','健康大致良好'],
        'lv' => ['避家居意外','凡事三思而后行','身心疲惫,易意外破财','浮沉星影响','感情易起伏','开车需谨慎','犯水险，远深水','投资理财需慎行','经商者事业运势稍差',
            '留意家中长辈健康问题','炒卖投机、不宜沾手'],
        'hong'=>['桃花旺','吉星照','多思考','多规划'],
        'yi' => ['创 新','创 作','考 学','置 业','婚 嫁'],
        'ji' => ['高 危 活 动','风 险 投 资']
    ],
    'niu' => [
        'ys' => ['谨慎做事、保守稳定','贵人帮身、做事可欣','逆流而上、处事低调','可于远方得名得利','劳而有功的一年','和气求稳为上策'],
        'lv' => ['起伏不定、事事小心','易有破财、明争暗斗','避免探病问丧','不与小人纠缠','警惕破财','防肝肾之病',
            '刑太岁、辛苦得财','入少出多、守旧为上','桃花不旺'],
        'hong'=>['防桃花劫','退守为安','注意安全'],
        'yi' => ['宜 动 不 静','尝 试 机 缘','外 出 旅 游','考 学','婚 嫁','添 丁'],
        'ji' => ['强 出 头','口 舌 是 非','作 息 不 定','病 符 西 方']
    ],
    'hu' => [
        'ys' => ['运势发展平稳','应脚踏实地，稳中求胜','事业发展顺利','有贵人鼎力相助','财运平稳向上,盛运之中',
            '宜正财远偏财','保持谦逊、理智冷静'],
        'lv' => ['少说话多做事','保持谦逊、理智冷静','切勿过于激进','财务必谨慎','投资不可跟风','说话做事要谨慎','容易陷入情绪困境','防恶意中伤','偏财流年'],
        'hong'=>['桃花旺','偏财流年','三合贵人'],
        'yi' => ['锐 意 进 取','求 学','添 丁','出 游','搬 迁'],
        'ji' => ['急 于 求 成','跟 风 投 资','探 病 问 丧','高 危 运 动']
    ],
    'tu' => [
        'ys' => ['贵人帮扶、合太岁','运势稳定,把握机会','脚踏实地专注','紫气东来、财源滚滚','正财偏财两旺'],
        'lv' => ['运势起伏、易受挫折','留意肝脏有疾','带眼识人、免人财两空','男性留心烂桃花','行车需小心谨慎','诸事小心、官非口舌','横财不利'],
        'hong' => ['桃花旺','吉星相助'],
        'yi' => ['团 队 合 作','外 地 发 展','跳 槽','置 业','添 丁'],
        'ji' => ['钱 财 外 露','风 险 投 机']
    ],
    'long' => [
        'ys' => ['正财运旺、谨慎保守','逢凶化吉','厚积、以等待良机','谋定而后动','注意锻炼和饮食','投资谨慎、宜节省开支','宜居家养性'],
        'lv' => ['冲太岁、以退为进','以和为贵','谨守岗位，安分守己','情感波折、坦诚以待','防烂桃花','作息规律,有疾早治','运势欠佳','小心钱财处理',
            '防盗及意外支出','防口舌是非，勿燥进'],
        'hong' => ['好事多磨','三思而行'],
        'yi' => ['谨 慎 保 守','三 思 而 行','考 学'],
        'ji' => ['风 险 投 资','钱 财 合 作','动 土']
    ],
    'she' => [
        'ys' => ['一路顺畅、名利两旺','佳偶天成、左右逢源','升职加薪、贵人相助','广结善缘、平稳有进步'],
        'lv' => ['少说话，多做事','谨防诱惑，不可滥情','凡事多忍让,注意沟通技巧','处变不惊，冷静面对','防肠胃有疾'],
        'hong' => ['桃花星','贵人扶助'],
        'yi' => ['跳 槽','介 绍 对 象','升 迁'],
        'ji' => ['三 心 二 意','远 行 不 顺']
    ],
    'ma' => [
        'ys' => ['左右逢源','福星高照，求财有期','“将星”临门、权名双收','斗志旺盛、逢凶化吉','脚踏实地、积极进取','正财平稳、偏财不平','宜动不宜静'],
        'lv' => ['不可过度追求安逸','提防破财','小心意外的受伤','多做善事可挡灾','不可过于劳心劳力','留意健康问题','提防小人，车船小心'],
        'hong' => ['运势极好','升职加薪','桃花朵朵'],
        'yi' => ['好 吃 懒 做','口 舌 生 祸','高 危 运 动'],
        'ji' => ['留 学','移 民','相 亲','添 丁','婚 嫁']
    ],
    'yang' => [
        'ys' => ['机遇和挑战并存','天德星临、贵人相助','保持心态豁达积极','熟悉领域创业易成功','利远方投资','投资获利、切忌贪心'],
        'lv' => ['祸从口出、招惹是非','切记谦虚谨慎','卷舌星临、不宜结怨','饮食宜清淡','合伙生财需谨慎','桃花不利'],
        'hong' => ['破太岁','升官进财','前途光明'],
        'yi' => ['交 友','外 出 公 干','外 出 旅 行'],
        'ji' => ['暴 饮 暴 食','投 资 贪 心','心 态 不 平']
    ],
    'hou' => [
        'ys' => ['驿马星临、利于远行','贵人扶助、财运畅通','情绪易波动','文昌入命、读书易成','经商投资、务求谨慎','财利进进出出',
            '稳中求财','提防小人陷害','不可有太大投资','桃花运平淡','出行谨慎、防健康受损'],
        'lv' => ['祸从口出、招惹是非','切记谦虚谨慎','卷舌星临，不宜结怨','饮食宜清淡','合伙生财需谨慎','桃花不利'],
        'hong' => ['谨言慎行','开源节流','戒急戒躁'],
        'yi' => ['外 出 经 商','出 差','进 修','考 证','搬 迁','出 国'],
        'ji' => ['探 病 问 丧','投 机 取 巧']
    ],
    'ji' => [
        'ys' => ['事业平稳上升','正财可期、偏财欠佳','不可贪不义之财','不宜做大的改变','安分守己，谨慎理财','审时度势，进退得当'],
        'lv' => ['防口舌是非','戒骄戒躁','遇到挫折切勿气馁','病符星临，留意健康','防肠胃有疾','有桃花运，易波折','横财不利，切勿借贷'],
        'hong' => ['害太岁','中规中矩','利社交'],
        'yi' => ['跳 槽','转 行','添 丁','婚 嫁','进 修'],
        'ji' => ['风 险 投 资','急 功 近 利','过 量 饮 酒']
    ],
    'gou' => [
        'ys' => ['正财偏财皆平','一动不如一静','一喜挡三灾','岁驾星临、才华得展',' 利运输与创作行业','可穿配转运之物','多变之年、三思而后行'],
        'lv' => ['太岁年、压力重重','本命年，谨言慎行','稳扎稳打、勿急勿躁','关心长辈健康','当心被骗、不利桃花','驾车需谨慎'],
        'hong' => ['利学习','守旧为上'],
        'yi' => ['外 出','结 伴 郊 游','婚 嫁','置 业','添 丁'],
        'ji' => ['任 性','跳 槽','定 盟','投 资','赌 博']
    ],
    'zhu' => [
        'ys' => ['桃花之年','事业运佳、有利投资','想象力丰富','三大吉星、运势佳','丰收的一年','太阳吉星、远行生财','冲刺之年、财运畅通'],
        'lv' => ['慎防破财,谨慎终不错','关注长辈健康','驾驶需留意，不宜结怨','劫煞作崇，小心受损'],
        'hong' => ['运气旺盛','贵人赏识','财运亨通'],
        'yi' => ['婚 嫁','添 丁','购 房','升 职'],
        'ji' => ['钱 财 外 漏','动 土']
    ],
];
